_org_posts/_posts/2022-02-02-abc239-d-upsolving.org
#+HTML: ---
#+HTML: title: abc239 D - Prime Sum Game
#+HTML: tags: AtCoder
#+HTML: ---
#+OPTIONS: ^:nil

** D - Prime Sum Game
- Taka가 A~B 사이 숫자 하나 내기
- Aoki가 C~D 사이 숫자 하나 내기
- prime(소수)이면 Aoki승, 아니면 Taka승이라고 할 때
- 누가 이기는가? (둘다 최적으로 게임을 하면)

** 접근하기
#+BEGIN_EXAMPLE
1. 두 선수가 낼 수 있는 모든 숫자의 조합을 모두 검사한다.
2. 모든 조합에서 소수만 나올 수 있으면, Aoki 승 아니면 Taka 승
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;
#define FASTIO ios_base::sync_with_stdio(false); cin.tie(NULL);
typedef long long ll;
#define INF 1e9

int N;
int p[201];
int a, b, c, d;

void make_prime()
{
	for(int i=2;i<=200;i++)
        p[i]=1;

	for(int i=2;i*i<=200;i++) {
        if(p[i]) {
            for(int j=i*i;j<=200;j+=i) {
                p[j]=0;
            }
        }
    }
}


int main(int argc, char* argv[])
{
    FASTIO
#ifndef ONLINE_JUDGE
//    freopen("input.txt", "r", stdin);
#endif
    
    cin >> a >> b >> c >> d;

    make_prime();
    for(int i=a;i<=b;i++) {
        int result = 1;     // Taka
        for(int j=c;j<=d;j++) {
            if (!p[i+j])
                result = result & 1;
            else
                result = result & 0;
        }
        if (result) {
            cout << "Takahashi" << '\n';
            return 0;
        }
    }
    cout << "Aoki" << '\n';
    return 0;
}
#+END_SRC

** 문제 링크
- https://atcoder.jp/contests/abc239/tasks/abc239_d
