_site/abc239-d-upsolving/index.html
<div id="outline-container-org8089dde" class="outline-2">
<h2 id="org8089dde">D - Prime Sum Game</h2>
<div class="outline-text-2" id="text-org8089dde">
<ul class="org-ul">
<li>Taka가 A~B 사이 숫자 하나 내기</li>
<li>Aoki가 C~D 사이 숫자 하나 내기</li>
<li>prime(소수)이면 Aoki승, 아니면 Taka승이라고 할 때</li>
<li>누가 이기는가? (둘다 최적으로 게임을 하면)</li>
</ul>
</div>
</div>

<div id="outline-container-orgad58952" class="outline-2">
<h2 id="orgad58952">접근하기</h2>
<div class="outline-text-2" id="text-orgad58952">
<pre class="example">
1. 두 선수가 낼 수 있는 모든 숫자의 조합을 모두 검사한다.
2. 모든 조합에서 소수만 나올 수 있으면, Aoki 승 아니면 Taka 승
</pre>
</div>
</div>

<div id="outline-container-orga1bea40" class="outline-2">
<h2 id="orga1bea40">코드</h2>
<div class="outline-text-2" id="text-orga1bea40">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p</span>[201];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>, <span style="color: #ff6347;">b</span>, <span style="color: #ff6347;">c</span>, <span style="color: #ff6347;">d</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">make_prime</span>()
{
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i&lt;=200;i++)
        p[i]=1;

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i*i&lt;=200;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span>(p[i]) {
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i*i;j&lt;=200;j+=i) {
                p[j]=0;
            }
        }
    }
}


<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
<span style="color: #729fcf;">#if</span><span style="color: #729fcf;">n</span><span style="color: #729fcf;">def</span> ONLINE_JUDGE
<span style="color: #888a85;">//    </span><span style="color: #888a85;">freopen("input.txt", "r", stdin);</span>
<span style="color: #729fcf;">#endif</span>

    <span style="color: #ff6347;">cin</span> &gt;&gt; a &gt;&gt; b &gt;&gt; c &gt;&gt; d;

    make_prime();
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=a;i&lt;=b;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">result</span> = 1;     <span style="color: #888a85;">// </span><span style="color: #888a85;">Taka</span>
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=c;j&lt;=d;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (!p[i+j])
                result = result &amp; 1;
            <span style="color: #729fcf; font-weight: bold;">else</span>
                result = result &amp; 0;
        }
        <span style="color: #729fcf; font-weight: bold;">if</span> (result) {
            cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"Takahashi"</span> &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
            <span style="color: #729fcf; font-weight: bold;">return</span> 0;
        }
    }
    cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"Aoki"</span> &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org768b90a" class="outline-2">
<h2 id="org768b90a">문제 링크</h2>
<div class="outline-text-2" id="text-org768b90a">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc239/tasks/abc239_d">https://atcoder.jp/contests/abc239/tasks/abc239_d</a></li>
</ul>
</div>
</div>
